{
  "input_file": "C:\\Users\\HP\\AppData\\Local\\Temp\\AI_Explaination.pdf",
  "pages": 1,
  "detected_lang": "en",
  "target_lang": "ta",
  "analysis": {
    "domain": "general",
    "tone": "neutral",
    "confidence": 0.2373090535402298
  },
  "source_text": "What Is Artificial Intelligence? Definition, Uses, and TypesArtificial intelligence (AI) refers to computer systems capable of performing complex tasksthat historically only humans could do, such as reasoning, making decisions, or solvingproblems. At a glance, here's what you need to know about artificial intelligence: Today, the term “AI” describes a wide range of technologies that power many of the services andgoods we use every day – from apps that recommend TV shows to chatbots that providecustomer support in real time. Machine learning is the most common form of artificial intelligence used today. As AI becomes more interwoven into our modern world, knowing how it works and how to use itcan help you better leverage the technology at work and in your personal life.In this article, you’ll learn more about artificial intelligence, what it actually does, and the differenttypes. You’ll also learn about some of its benefits and dangers and explore flexible courses thatcan help you expand your knowledge of AI even further. If you're ready to start building your AIskills, consider enrolling in the IBM AI Foundations for Everyone Specialization, where you'll gaina firm understanding of what AI is, its applications, and use cases across various industries.What is artificial intelligence?Artificial intelligence (AI) is the theory and development of computer systems capable ofperforming tasks that historically required human intelligence, such as recognizing speech,making decisions, and identifying patterns. AI is an umbrella term that encompasses a widevariety of technologies, including machine learning, deep learning, and natural languageprocessing (NLP).Although the term is commonly used to describe a range of different technologies in use today,many disagree on whether these actually constitute artificial intelligence. Instead, some arguethat much of the technology used in the real world today actually constitutes highly advancedmachine learning that is simply a first step towards true artificial intelligence, or “general artificialintelligence” (GAI).Despite the many philosophical disagreements over whether “true” intelligent machines actuallyexist, when most people use the term AI today, they’re referring to a suite of machine learning-powered technologies, such as Chat GPT or computer vision, that enable machines to performtasks that previously only humans can do like generating written content, steering a car, oranalyzing data.How about artificial \"general\" intelligence?Artificial general intelligence (AGI) refers to a theoretical state in which computer systems will beable to achieve or exceed human intelligence. In other words, AGI is “true” artificial intelligence,as depicted in countless science fiction novels, television shows, movies, and comics.Regardless of how far we are from achieving AGI, you can assume that when someone uses theterm artificial general intelligence, they’re referring to the kind of sentient computer programs andmachines that are commonly found in popular science fiction.Read more: What Is Artificial General Intelligence? Definition and ExamplesArtificial intelligence examplesThough the humanoid robots often associated with AI (think Star Trek: The NextGeneration’s Data or Terminator’s T-800) don’t exist yet, you’ve likely interacted with machinelearning-powered services or devices many times before.At the simplest level, machine learning uses algorithms trained on data sets to create machinelearning models that allow computer systems to perform tasks like making songrecommendations, identifying the fastest way to travel to a destination, or translating text fromone language to another. Some of the most common examples of AI in use today include: ChatGPT: Uses large language models (LLMs) to generate text in response to questions orcomments posed to it. Google Translate: Uses deep learning algorithms to translate text from one language toanother. Netflix: Uses machine learning algorithms to create personalized recommendation engines forusers based on their previous viewing history. Apple's Siri: Apple's voice-activated personal assistant, Siri, is powered by deep neuralnetworks (DNNs) to interact with users and complete their requests.What does AI stand for?AI stands for \"artificial intelligence.\" Artificial intelligence is the simulation of human intelligenceprocesses by machines, such as computer systems. AI powers many technology-drivenindustries, such as health care, finance, transportation, and much more.Read more: What Does AI Stand For?AI in the workforceArtificial intelligence is prevalent across many industries. Automating tasks that don't requirehuman intervention saves money and time, and can reduce the risk of human error. Here are acouple of ways AI could be employed in different industries: Finance industry. Fraud detection is a notable use case for AI in the finance industry. AI'scapability to analyze large amounts of data enables it to detect anomalies or patterns that signalfraudulent behavior. Health care industry. AI-powered robotics could support surgeries close to highly delicateorgans or tissue to mitigate blood loss or risk of infection.Want to build your AI skills?Enroll in AI for Everyone, an online program offered by DeepLearning.AI. In just 6 hours, you'llgain foundational knowledge about AI terminology, strategy, and the workflow of machinelearning projects. Your first week is free.",
  "audio_source": "static/audio\\en_20251201_182230_0fde59ca_What Is .mp3",
  "translated_text": "Artificial Intelligence என்றால் என்ன? வரையறை, பயன்பாடுகள் மற்றும் வகைகள். செயற்கை நுண்ணறிவு (AI) என்பது மனிதர்கள் மட்டுமே செய்யக்கூடிய, காரணம் கூறுதல், முடிவுகள் எடுக்குதல் அல்லது சிக்கல்களை தீர்க்குதல் போன்ற சிக்கலான பணிகளை செய்யக்கூடிய கணினி அமைப்புகளை குறிக்கிறது. செயற்கை நுண்ணறிவைப் பற்றிய அடிப்படைகளைப் புரிந்துகொள்ள, இன்று \"AI\" என்ற சொல் பல்வேறு தொழில்நுட்பங்களை விவரிக்கிறது, அவை தினசரி பயன்படுத்தும் சேவைகள் மற்றும் பொருட்களை இயக்குகிறது - தொலைக்காட்சி நிகழ்ச்சிகளை பரிந்துரைக்கும் செயலிகளிலிருந்து, நேரடி வாடிக்கையாளர் ஆதரவை வழங்கும் சாட்‌பாட்கள் வரை. இன்று பயன்படுத்தப்படும் செயற்கை நுண்ணறிவின் மிக முக்கியமான வடிவம் இயந்திரக் கற்றல் ஆகும். AI நமது நவீன உலகில் மேலும் இணைந்தபோது, அது எப்படி செயல்படுகிறது மற்றும் அதை எப்படி பயன்படுத்துவது என்பதைப் புரிந்துகொள்வது, தொழிலில் மற்றும் தனிப்பட்ட வாழ்க்கையில் தொழில்நுட்பத்தை சிறப்பாக பயன்படுத்த உதவும். இந்த கட்டுரையில், செயற்கை நுண்ணறிவைப் பற்றிய மேலும் தகவல்களைப் பெறுவீர்கள், அது உண்மையில் என்ன செய்கிறது மற்றும் அதன் வெவ்வேறு வகைகள். அதன் பலன்கள் மற்றும் ஆபத்திகள் பற்றியும் நீங்கள் அறிந்து கொள்ளலாம் மற்றும் AI பற்றிய உங்கள் அறிவை மேலும் விரிவுபடுத்த உதவும் மாறுபட்ட பாடங்களை ஆராயலாம். உங்கள் AI திறன்களை உருவாக்கத் தயாராக இருந்தால், IBM AI Foundations for Everyone Specialization-ல் சேர்வதைக் கருத்தில் கொள்ளுங்கள், அங்கு AI என்ன, அதன் பயன்பாடுகள் மற்றும் பல்வேறு தொழில்களில் அதன் பயன்பாடுகள் பற்றிய உறுதியான புரிதலைப் பெறுவீர்கள். செயற்கை நுண்ணறிவு என்றால் என்ன? செயற்கை நுண்ணறிவு (AI) என்பது மனித நுண்ணறிவை தேவைப்படும் பணிகளை செய்யக்கூடிய கணினி அமைப்புகளின் கோட்பாடு மற்றும் வளர்ச்சி ஆகும், உதாரணமாக பேச்சை அடையாளம் காணுதல், முடிவுகள் எடுக்குதல் மற்றும் மாதிரிகளை அடையாளம் காணுதல். AI என்பது இயந்திரக் கற்றல், ஆழ்ந்த கற்றல் மற்றும் இயற்கை மொழி செயலாக்கம் (NLP) போன்ற பல்வேறு தொழில்நுட்பங்களை உள்ளடக்கிய ஒரு கூட்டு சொல் ஆகும். இன்று பயன்படுத்தப்படும் பல்வேறு தொழில்நுட்பங்களை விவரிக்க பொதுவாக இந்த சொல் பயன்படுத்தப்படுகிறது, ஆனால் இவை செயற்கை நுண்ணறிவாகக் கருதப்படுகிறதா என்பது குறித்து பலர் மோதுகின்றனர். உண்மையில், இன்று உலகில் பயன்படுத்தப்படும் தொழில்நுட்பங்களில் பெரும்பாலானவை, உண்மையான செயற்கை நுண்ணறிவுக்கு (அல்லது \"பொது செயற்கை நுண்ணறிவு\" (GAI)) முதல் படியாகக் கருதப்படும் மிகவும் மேம்பட்ட இயந்திரக் கற்றலாகக் கருதப்படுகின்றன. \"உண்மையான\" நுண்ணறிவு இயந்திரங்கள் உள்ளதா என்பது குறித்து பல தத்துவ மோதல்கள் உள்ளன, ஆனால் இன்று பெரும்பாலான மக்கள் AI என்ற சொலைப் பயன்படுத்தும் போது, அவர்கள் Chat GPT அல்லது கணினி பார்வை போன்ற இயந்திரங்களை செயல்படுத்தும் இயந்திரக் கற்றல் அடிப்படையிலான தொழில்நுட்பங்களை குறிக்கிறார்கள், அவை முன்பு மனிதர்கள் மட்டுமே செய்யக்கூடிய பணிகளைச் செய்ய உதவுகிறது, எழுத்து உள்ளடக்கம் உருவாக்குதல், கார் இயக்குதல் அல்லது தரவுகளை பகுப்பாய்வு செய்வது போன்றவை. செயற்கை \"பொது\" நுண்ணறிவு பற்றி என்ன? செயற்கை பொது நுண்ணறிவு (AGI) என்பது கணினி அமைப்புகள் மனித நுண்ணறிவை அடைய அல்லது மீறக்கூடிய ஒரு கோட்பாட்டை குறிக்கிறது. மற்றொரு வார்த்தையில், AGI என்பது \"உண்மையான\" செயற்கை நுண்ணறிவு ஆகும், இது எண்ணற்ற அறிவியல் கற்பனை நாவல்கள், தொலைக்காட்சி நிகழ்ச்சிகள், திரைப்படங்கள் மற்றும் காமிக்ஸ் ஆகியவற்றில் விவரிக்கப்பட்டுள்ளது. AGI-ஐ அடைய எவ்வளவு தொலைவில் இருக்கிறோம் என்பதற்கான விவாதங்கள் இருந்தாலும், யாராவது செயற்கை பொது நுண்ணறிவு என்ற சொலைப் பயன்படுத்தும் போது, அவர்கள் பொதுவாக பிரபலமான அறிவியல் கற்பனை கதைகளில் காணப்படும் உணர்வுள்ள கணினி நிரல்களையும் இயந்திரங்களையும் குறிக்கிறார்கள். செயற்கை நுண்ணறிவின் எடுத்துக்காட்டுகள். AI-க்கு தொடர்பான மனித வடிவத்திலான ரோபோக்கள் (Star Trek: The Next Generation-இன் Data அல்லது Terminator-இன் T-800 போன்றவை) இன்னும் இல்லை, ஆனால் நீங்கள் இயந்திரக் கற்றல் அடிப்படையிலான சேவைகள் அல்லது சாதனங்களுடன் பல முறை தொடர்பு கொண்டிருக்கலாம். மிக எளிய அளவில், இயந்திரக் கற்றல் தரவுத்தொகுப்புகளில் பயிற்சியளிக்கப்பட்ட அல்காரிதங்களைப் பயன்படுத்தி, கணினி அமைப்புகள் பாடல்களை பரிந்துரைக்க, ஒரு இடத்திற்கு பயணிக்க மிக வேகமாக செல்லும் வழியை அடையாளம் காண அல்லது ஒரு மொழியிலிருந்து மற்றொரு மொழிக்கு உரையை மொழிபெயர்க்க போன்ற பணிகளைச் செய்ய அனுமதிக்கும் இயந்திரக் கற்றல் மாதிரிகளை உருவாக்குகிறது. இன்று பயன்படுத்தப்படும் AI-ன் சில பொதுவான எடுத்துக்காட்டுகள்: ChatGPT: கேள்விகள் அல்லது கருத்துக்களுக்கு பதிலளிக்க உரையை உருவாக்க பெரிய மொழி மாதிரிகளை (LLMs) பயன்படுத்துகிறது. Google Translate: ஒரு மொழியிலிருந்து மற்றொரு மொழிக்கு உரையை மொழிபெயர்க்க ஆழ்ந்த கற்றல் அல்காரிதங்களைப் பயன்படுத்துகிறது. Netflix: பயனர் முந்தைய பார்வை வரலாற்றின் அடிப்படையில் தனிப்பட்ட பரிந்துரைகளை உருவாக்க இயந்திரக் கற்றல் அல்காரிதங்களைப் பயன்படுத்துகிறது. Apple's Siri: Apple-இன் குரல் செயல்பாட்டை கொண்ட தனிப்பட்ட உதவியாளர், Siri, பயனர்களுடன் தொடர்பு கொள்ள மற்றும் அவர்களின் கோரிக்கைகளை நிறைவேற்ற ஆழ்ந்த நரம்பியல் நெட்வொர்க்களை (DNNs) பயன்படுத்துகிறது. AI என்றால் என்ன? AI என்பது \"செயற்கை நுண்ணறிவு\" என்பதற்கான சுருக்கமாகும். செயற்கை நுண்ணறிவு என்பது மனித நுண்ணறிவு செயல்முறைகளை இயந்திரங்கள், கணினி அமைப்புகள் போன்றவற்றால் ஒத்திசைக்கப்படுவது ஆகும். AI பல தொழில்நுட்ப இயக்கத்திற்கான தொழில்களில் பரவலாக உள்ளது, உதாரணமாக சுகாதாரம், நிதி, போக்குவரத்து மற்றும் பல. AI தொழில்நுட்பத்தில். செயற்கை நுண்ணறிவு பல தொழில்களில் பரவலாக உள்ளது. மனித müdhalilai தேவைப்படாத பணிகளை தானாகச் செய்யும் திறன், பணம் மற்றும் நேரத்தைச் சேமிக்கிறது, மேலும் மனித பிழையின் ஆபத்தை குறைக்கலாம். பல்வேறு தொழில்களில் AI-ஐப் பயன்படுத்துவதற்கான சில வழிகள்: நிதி துறை. மோசடி கண்டறிதல் என்பது நிதி துறையில் AI-க்கு குறிப்பிடத்தக்க பயன்பாடாகும். பெரிய அளவிலான தரவுகளை பகுப்பாய்வு செய்ய AI-ன் திறன், மோசடி நடத்தும் நடத்தை குறிக்கும் அசாதாரணங்கள் அல்லது மாதிரிகளை கண்டறிய உதவுகிறது. சுகாதாரத் துறை. AI-ஐ அடிப்படையாகக் கொண்ட ரோபோடிக்ஸ், ரத்தக் காயம் அல்லது தொற்றுநோயின் ஆபத்தை குறைக்க, மிகவும் நுணுக்கமான உறுப்புகள் அல்லது திசுக்களைச் சுற்றி அறுவை சிகிச்சைகளை ஆதரிக்கலாம். உங்கள் AI திறன்களை உருவாக்க விரும்புகிறீர்களா? DeepLearning.AI-யால் வழங்கப்படும் AI for Everyone என்ற ஆன்லைன் திட்டத்தில் சேருங்கள். 6 மணி நேரத்தில், AI சொற்களவியல், உத்திகள் மற்றும் இயந்திரக் கற்றல் திட்டங்களின் வேலைப்பாட்டைப் பற்றிய அடிப்படையான அறிவைப் பெறுவீர்கள். உங்கள் முதல் வாரம் இலவசமாக உள்ளது.",
  "translated_audio": "static/audio\\ta_20251201_182356_c5ef6a70_Artifici.mp3"
}